data = [
  {
      "pergunta": "O que define uma arquitetura do tipo RISC?",
      "opcoes": [
          "Um conjunto de instruções muito complexas.",
          "Um conjunto grande de instruções simples.",
          "Um conjunto pequeno de instruções simples.",
          "Todas as instruções possuem tamanho fixo.",
          "Instruções com tempo de execução variável."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "O que são hazards de pipeline?",
      "opcoes": [
          "Hazards são dependências entre instruções na execução de um programa.",
          "Hazards são erros de leitura da memória na execução de instruções como Store word ou Load word.",
          "Hazards são situações em que uma instrução não pode ser executada no ciclo de clock correto devido à falta de um dado necessário ainda não obtido."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "Qual é a maior vantagem de uma arquitetura pipeline?",
      "opcoes": [
          "O conjunto de instruções necessário é menor.",
          "A eficiência é aumentada visto que é possivel executar partes de diferentes instruções no mesmo ciclo de clock.",
          "O circuito utilizado para sua implementação é muito simples em comparação com outras arquiteturas.",
          "Não existem problemas de dependência em arquiteturas pipeline."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "Em uma arquitetura pipeline, qual é o papel da forwarding unit (unidade de adiantamento)?",
      "opcoes": [
          "Adiantar o ciclo de clock atual, ou seja, acelerá-lo.",
          "Adiantar resultados calculados em ciclos de clock anteriores ao ciclo de clock atual.",
          "Adiantar dados vindos da memória, isto é, utilizar uma memória cache de forma que seja mais fácil a busca por um dado."
      ],
      "resposta": "1"
  }, 
  {
      "pergunta": "Em uma arquitetura pipeline, qual é o papel da unidade de controle?",
      "opcoes": [
          "A unidade de controle está encarregada de garantir que não haja dessincronização de clock.",
          "A unidade de controle é encarregada de interligar os componentes da arquitetura.",
          "A unidade de controle controla o clock.",
          "A unidade de controle só possui uma função: controlar as unidades de adiantamento e detecção de hazards.",
          "A unidade de controle é encarregada de reger os sinais de controle da arquitetura."
      ],
      "resposta": "4"
  },
  {
      "pergunta": "O que é pipelining?",
      "opcoes": [
          "É a implementação de uma técnica em que múltiplas instruções são executadas sequencialmente.",
          "É a implementação de uma técnica em que uma única instrução é executada em diversos estágios.",
          "É a implementação de uma técnica em que múltiplas instruções são sobrepostas durante a execução.",
          "É a implementação de uma técnica em que múltiplas instruções são executadas de maneira assíncrona."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "Na ordem, quais são os estágios da implementação pipeline de uma arquitetura MIPS?",
      "opcoes": [
          "Instruction Fetch, Instruction Decode, Execution, Memory Access, Write-back.",
          "Instruction Formatting, Instruction Decode, Execution, Memory Allocation, Write-back.",
          "Instruction Fetch, Instruction Decode, Execution, Memory Access, Write-binary",
          "Instruction Fetch, Instruction Decode, Memory Access, Execution, Write-back."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "Na arquitetura pipeline, o que caracteriza uma bolha (ou pipeline-stall)?",
      "opcoes": [
          "É uma parada iniciada com a intenção de resolver um hazard.",
          "É uma parada não intencional do pipeline.",
          "É um método de otimização do pipeline.",
          "Uma bolha é uma instrução não pode ser executada no ciclo de clock correto devido à falta de um dado necessário ainda não obtido."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "Um processador sem hazards estruturais é:",
      "opcoes": [
          "Mais lento.",
          "Mais rápido.",
          "Possui ciclo de clock mais longo.",
          "Possui taxa de clock mais alta."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "Se um evento ocorre no mesmo lugar toda vez que um programa é executado com os mesmos dados e alocação de memória, esse evento é:",
      "opcoes": [
          "Assíncrono.",
          "Síncrono.",
          "Atrasado.",
          "Parado."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "Em uma arquitetura de três caches. Dentre as relações de grandeza entre as diferentes caches, qual está correta?",
      "opcoes": [
          "L3 > L1 > L2",
          "L1 > L2 > L3",
          "L1 > L3 > L2",
          "L3 > L2 > L1"
      ],
      "resposta": "3"
  },
  {
      "pergunta": "Um algoritmo de substituição em caches que remove o elemento menos recentemente utilizado recebe qual sigla?",
      "opcoes": [
          "FIFO.",
          "LRU.",
          "LFU.",
          "Aleatório."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "Um algoritmo de substituição em caches que remove o elemento menos frequentemente utilizado recebe qual sigla?",
      "opcoes": [
          "FIFO.",
          "LRU.",
          "LFU.",
          "Aleatório."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "No que tange os acessos à memórias cache, o caracteriza um acerto?",
      "opcoes": [
          "A palavra buscada não é encontrada na cache.",
          "A inserção de uma palavra na cache é feita com sucesso.",
          "A palavra buscada é encontrada na cache.",
          "A inserção de uma palavra na cache substitui uma palavra ja existente nela."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "O que define a função de mapeamento direto em memórias cache?",
      "opcoes": [
          "Cada bloco na memória principal é mapeado em um único bloco da cache.",
          "Um bloco da memória principal pode ser carregado em qualquer bloco da memória cache.",
          "A memória cache é dividida em V conjuntos de K blocos cada e cada bloco da memória principal sempre é mapeado em um único conjunto."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "O que define a função de mapeamento associativo em memórias cache?",
      "opcoes": [
          "Cada bloco na memória principal é mapeado em um único bloco da cache.",
          "Um bloco da memória principal pode ser carregado em qualquer bloco da memória cache.",
          "A memória cache é dividida em V conjuntos de K blocos cada e cada bloco da memória principal sempre é mapeado em um único conjunto."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "O que define a função de mapeamento associativo por conjunto em memórias cache?",
      "opcoes": [
          "Cada bloco na memória principal é mapeado em um único bloco da cache.",
          "Um bloco da memória principal pode ser carregado em qualquer bloco da memória cache.",
          "A memória cache é dividida em V conjuntos de K blocos cada e cada bloco da memória principal sempre é mapeado em um único conjunto."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "O que é o princípio da localidade temporal?",
      "opcoes": [
          "Se um dado na memória foi utilizado em um instante, existe a probabilidade dele ser utilizado novamente num instante futuro.",
          "Se um dado na memória foi utilizado com frequência, ele será utilizado novamente no futuro.",
          "Se um dado na memória foi utilizado em um instante, ele não será utilizado no futuro."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "O que é o princípio da localidade espacial?",
      "opcoes": [
          "Se um dado na memória foi utilizado, os dados adjacentes serão os próximos a serem usados.",
          "Se um dado na memória foi utilizado, não é necessário utilizar os dados das posições adjacentes.",
          "Se um dado na memória foi utilizado, existe a probabilidade das posições que estão perto serem utilizadas também."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "O que pode-se inferir a partir do tamanho da cache?",
      "opcoes": [
          "Quanto maior, mais rápida.",
          "Quanto menor, mais rápida.",
          "Quanto menor, mais lenta."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "O que pode-se inferir a partir do tamanho do bloco da cache?",
      "opcoes": [
          "Quanto maior, maior a taxa de acerto.",
          "Quanto maior, menor a taxa de acerto.",
          "Quanto maior, mais rápido."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "Qual é a relação de tamanho entre os blocos da memória principal e os blocos da memória cache imediatamente acima?",
      "opcoes": [
          "Devem possuir o mesmo tamanho.",
          "Os blocos da memória principal devem ser maiores.",
          "Os blocos da memória principal devem ser menores.",
          "Não há relação."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "Qual é a maior vantagem de utilizar uma função de mapeamento associativo em memórias cache?",
      "opcoes": [
          "Maior simplicidade do conjunto de circuitos necessários para a comparação dos rótulos dos blocos da memória cache.",
          "Possui baixo custo de implementação.",
          "É uma técnica simples.",
          "Garante maior flexibilidade para a escolha do bloco a ser substituído quando um novo bloco é trazido para a memória cache."
      ],
      "resposta": "3"
  },
  {
      "pergunta": "Qual é a maior vantagem de utilizar uma função de mapeamento associativo em memórias cache?",
      "opcoes": [
          "Maior simplicidade do conjunto de circuitos necessários para a comparação dos rótulos dos blocos da memória cache.",
          "Possui baixo custo de implementação.",
          "É uma técnica simples.",
          "Garante maior flexibilidade para a escolha do bloco a ser substituído quando um novo bloco é trazido para a memória cache."
      ],
      "resposta": "3"
  },
  {
      "pergunta": "Qual a desvantagem de se utilizar uma arquitetura com um único ciclo?",
      "opcoes": [
          "Possui uma implementação mais complexa àquela de uma arquitetura pipeline.",
          "É um grande problema quando são consideradas instruções simples.",
          "O uso do ciclo de clock se torna ineficiente, pois este deve ser do tamanho da instrução mais rápida.",
          "O uso do ciclo de clock se torna ineficiente, pois este deve ser do tamanho da instrução mais lenta."
      ],
      "resposta": "3"
  },
  {
      "pergunta": "O que significa a sigla ULA?",
      "opcoes": [
          "Unidade lógica aritmética.",
          "Unidade lógica assíncrona.",
          "Unidade linear aritmética."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "O que caracterizam as dependências de dados?",
      "opcoes": [
          "São casos em que a instrução do clock atual depende dos resultados de instruções anteriores, ainda não completadas.",
          "São casos em que são feitos acessos simultâneos à memória por 2 ou mais estágios.",
          "São casos em que a próxima instrução a ser executada não está no endereço subsequente ao da instrução anterior."
      ],
      "resposta": "0"
  },
  {
      "pergunta": "O que caracterizam os conflitos estruturais?",
      "opcoes": [
          "São casos em que a instrução do clock atual depende dos resultados de instruções anteriores, ainda não completadas.",
          "São casos em que são feitos acessos simultâneos à memória por 2 ou mais estágios.",
          "São casos em que a próxima instrução a ser executada não está no endereço subsequente ao da instrução anterior."
      ],
      "resposta": "1"
  },
  {
      "pergunta": "O que caracterizam as dependências de controle?",
      "opcoes": [
          "São casos em que a instrução do clock atual depende dos resultados de instruções anteriores, ainda não completadas.",
          "São casos em que são feitos acessos simultâneos à memória por 2 ou mais estágios.",
          "São casos em que a próxima instrução a ser executada não está no endereço subsequente ao da instrução anterior."
      ],
      "resposta": "2"
  },
  {
      "pergunta": "Dentre as seguintes dependências: RAW, WAW, WAR, RAR. Quais representam problemas para o pipeline?",
      "opcoes": [
          "Apenas a WAR.",
          "Todas elas.",
          "Apenas a RAW.",
          "Ambas a WAR e a RAW."
      ],
      "resposta": "2"
  }
];
